<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt" %>

<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>대덕병원 | 회원 이용약관</title>

<!-- Google Font: Source Sans Pro -->
  <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:300,400,400i,700&display=fallback">
  <!-- Font Awesome Icons -->
  <link rel="stylesheet" href="<%=request.getContextPath()%>/resources/bootstrap/plugins/fontawesome-free/css/all.min.css">
  <!-- Theme style -->
  <link rel="stylesheet" href="<%=request.getContextPath()%>/resources/bootstrap/dist/css/adminlte.min.css">



<body class="hold-transition login-page">
<div class="login-box">
<div class="login-logo">
<h1><a href="<%=request.getContextPath()%>"><img src="<%=request.getContextPath()%>/resources/img/logo/logo2.png"></a></h1>
</div>
<form >
<div class="card">
<div class="card-body login-card-body">

 
 <textarea class="form-control"  style="resize: none;" rows="8"> 이용약관 
 
01. 제 1조 (목적)
• 대덕병원 홈페이지 이용약관(이하 "본 약관"이라 합니다)은 이용자가 대덕병원(이하 "병원"이라 합니다)에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 합니다)를 이용함에 있어 이용자와 "병원"의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.
02. 제 2조 (정의)
• ① 이용자(회원) : "병원 홈페이지"에 접속하여 본 약관에 따라 "병원" 회원으로 가입하여 "병원"이 제공하는 서비스를 받는 자를 말합니다.
• ② 운영자 : 서비스의 전반적인 관리와 원활한 운영을 위하여 병원에서 선정한 자를 말합니다.
• ③ 연결 사이트 : 홈페이지와 하이퍼링크 방식(하이퍼링크의 대상에는 문자, 정지 및 동화상 등이 포함됨) 등으로 연결된 웹 사이트를 말합니다.
• ④ 가입 : 홈페이지에서 제공하는 신청서 양식에 해당 정보를 기입하고, 본 약관에 동의하여 서비스 이용계약을 완료시키는 행위를 말합니다.
• ⑤ 계정(ID) : 회원의 식별과 서비스 이용을 위하여 회원이 선정하고 병원이 규정하는 문자, 숫자의 조합을 의미합니다.
• ⑥ 비밀번호 : 회원이 부여받은 계정과 일치되는 회원임을 확인하고 회원의 정보 및 권익보호를 위해 회원 자신이 선정하여 비밀로 관리하는 문자, 숫자 또는 특수문자의 조합을 의미합니다.
• ⑦ 개인정보 : 당해 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 특정 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 인식할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함한다)를 말합니다.
• ⑧ 탈퇴 : 이용자가 서비스 개통 후 이용계약을 종료시키는 행위를 말합니다.
03. 제 3조 (약관의 게시 및 변경)
• ① 병원은 본 약관의 내용과 상호, 병원 소재지, 전자우편 주소 등을 이용자가 알 수 있도록 홈페이지에 게시합니다.
• ② 병원은 불가피한 사정이 있는 경우 관계법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
• ③ 병원은 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 서비스화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.
• ④ 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 관계법령 또는 상관례에 따릅니다.
04. 제 4조 (서비스의 제공 및 변경)
• ① 병원은 다음의 서비스를 제공합니다.
• 병원의 의료진 및 진료일정 안내
• 병원 또는 연결사이트를 통해 제공되는 각종 예약 서비스
• 병원 또는 연결사이트를 통해서 제공되는 건강상담 서비스
• 병원에서 제공하는 건강정보
• 기타 병원이 정하는 서비스
② 병원은 불가피한 사정이 있는 경우 제공하는 서비스의 내용을 변경할 수 있으며, 이 경우 변경된 서비스의 내용 및 제공일자를 명시하여 그 제공일자 이전 7일부터 공지합니다.
③ 병원은 서비스 내용의 변경으로 인하여 이용자가 입은 손해에 대하여 배상하지 아니합니다. 단, 병원의 고의 또는 중과실이 있는 경우에는 그러하지 아니합니다.
05. 제 5조 (서비스의 중단)
• ① 병원은 시스템 등 장치의 보수점검·교체 및 고장, 통신의 두절, 기타 불가항력적 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
• ② 병원은 제1항의 사유로 서비스 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여는 배상하지 아니합니다. 단, 병원의 고의 또는 중과실이 있는 경우에는 그러하지 아니합니다.
제2장 회원의 가입 및 탈퇴
06. 제 6조 (회원가입)
• ① 이용자는 병원의 정한 양식에 따라 회원정보를 기입한 후 본 약관에 동의한다는 의사표시를 함으로써 회원가입을 신청합니다.
• ② 병원은 전항과 같이 회원으로 가입할 것을 신청한 이용자 중 이하 각호에 해당하지 않는 한 회원으로 등록합니다.
• 가입신청자가 본 약관 제7조 제2항에 의거하여 이전에 회원 자격을 상실한 적이 있는 경우
• 등록내용에 허위, 기재누락, 오기가 있는 경우
• 기타 회원으로 등록하는 것이 병원의 기술상 또는 업무 수행상 현저히 지장이 있다고 판단하는 경우
③ 회원가입계약의 성립 시기는 병원이 승낙한 시점으로 합니다.
④ 회원은 등록사항의 변경이 있는 경우, 인터넷을 통하여 수정하거나 전자우편 또는 기타방법으로 병원에 통보하여야 합니다. 회원정보를 수정하지 않음으로 인하여 발생하는 모든 책임은 회원에게 있습니다.
07. 제 7조 (회원 탈퇴 및 자격의 상실 등)
• ① 회원은 병원의 서비스에 언제든지 탈퇴를 할 수 있습니다. 회원이 회원탈퇴를 신청한 경우 병원은 회원 본인 여부를 확인할 수 있으며, 해당 회원이 본인으로 확인되는 경우에 회원의 신청에 따른 조치를 취합니다.
• ② 회원이 회원탈퇴를 원하는 경우에는 서비스 내 회원탈퇴 절차를 통하여 회원탈퇴를 할 수 있습니다.
• ③ 회원이 다음 각 호의 사유에 해당하는 경우, 병원은 회원자격을 상실시킬 수 있습니다.
• 가입 신청 시 허위내용을 등록한 경우
• 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 질서를 위협하는 경우
• 병원 내에서 검증되지 않은 허위정보 및 기타 허락되지 않은 물품의 판매 행위를 하는 경우
• 병원 내에서 허락되지 않은 진료행위 또는 진료행위를 위한 선전의 장소로 이용하는 경우
• 병원 내에 제공되는 정보를 변경하는 등 홈페이지 운영을 방해한 경우
• 병원을 이용하여 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
• 본 약관을 위배한 경우
• 기타 회원으로서의 자격을 지속시키는 것이 부적절하다고 판단되는 경우
④ 홈페이지/모바일의 사이트를 1년 이상 미이용시에는 휴면계정으로 전환되고 데이터는 분리 보관 됩니다. 2년 이상 미이용시에는 개인정보를 파기합니다.
08. 제 8조 (회원에 대한 통지)
• ① 병원은 회원에 대한 통지를 하는 경우, 회원이 병원에 제공한 전자우편 주소 또는 전화번호로 할 수 있습니다.
• ② 병원은 불특정다수 회원에 대한 통지의 경우 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.
09. 제 9조 (진료예약의 신청 및 성립)
• ① 이용자는 병원 홈페이지 상에서 이하의 방법에 의하여 진료예약을 신청합니다.
• 주민등록번호(실명인증), 비밀번호, 성명, 주소, 전화번호 입력
• 이 약관에 동의한다는 표시
• 의료진, 진료과, 예약일시 선택
② 병원은 제1항의 예약신청에 대하여 다음 각 호의 사유에 해당하지 않는 한 승낙합니다.
• 신청 내용에 허위, 기재누락, 오기가 있는 경우
• 기타 예약신청에 승낙하는 것이 기술상 현저히 지장이 있다고 판단하는 경우
• 병원의 승낙 통지가 이용자의 전자우편으로 도달된 때에 예약이 성립된 것으로 봅니다.
제3장 개인정보의 보호 및 관리
10. 제 10조 (회원 계정(ID) 및 비밀번호)
• ① 병원은 회원에 대하여 회원의 정보 보호, 서비스 이용안내 등의 편의를 위해 회원이 선정한 일정한 문자, 숫자의 조합을 계정으로 부여합니다.
• ② 만 14세 미만의 어린이는 부모 등 법정 대리인의 동의를 얻은 후에 서비스 이용을 신청하여야 합니다.
• ③ 병원은 개인정보를 통하여 당해 회원의 서비스 이용가능 여부 등의 제반 회원 관리업무를 수행합니다.
• ④ 회원은 자신의 개인정보를 선량한 관리자로서의 주의 의무를 다하여 관리하여야 합니다. 회원이 본인의 개인정보를 소홀히 관리하거나 제3자에게 이용을 승낙함으로써 발생하는 손해에 대하여는 회원에게 책임이 있습니다.
• ⑤ 비밀번호의 관리책임은 회원에게 있으며, 회원이 원하는 경우에는 보안상의 이유 등으로 언제든지 변경이 가능합니다.
• ⑥ 회원은 정기적으로 비밀번호를 변경하여야 합니다.
11. 제 11조 (회원 정보의 제공 및 변경)
• ① 회원은 이 약관에 의하여 병원에 정보를 제공하여야 하는 경우에는 진실된 정보를 제공하여야 하며, 허위정보 제공으로 인해 발생한 불이익에 대해서는 보호받지 못합니다.
• ② 회원은 개인정보관리화면을 통하여 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 실명, 계정(ID) 등은 수정이 불가능합니다.
• ③ 회원은 회원가입 신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 기타 방법으로 병원에 대하여 그 변경사항을 알려야 합니다.
• ④ 제2항의 변경사항을 병원에 알리지 않아 발생한 불이익에 대하여 병원은 책임을 지지 않습니다.
12. 제 12조 (개인정보의 보호 및 관리)
• 병원은 관련법령이 정하는 바에 따라서 이용자의 개인정보를 보호하기 위하여 노력합니다. 이용자의 개인정보보호 및 사용에 대해서는 관련법령 및 병원이 별도로 고지하는 "개인정보처리방침"이 적용됩니다.
• 서비스의 일부로 제공되는 개별 서비스를 제외한 것으로서 홈페이지 및 서비스별 웹사이트에서 단순히 링크된 연결사이트에 대하여는 병원의 개인정보처리방침이 적용되지 않습니다.
• 병원은 회원의 귀책사유로 인하여 노출된 회원의 계정정보를 포함한 모든 정보에 대해서 일체의 책임을 지지 않습니다.
제4장 서비스에 관한 책임의 제한
13. 제 13조 (건강상담서비스)
• ① 병원은 이용자의 상담 내용이 상담 의료인을 제외한 제3자에게 유출되지 않도록 최선을 다해 보안을 유지하려고 노력합니다. 다만, 다음 각 호의 사유로 인하여 상담 내용이 공개 또는 훼손된 경우 병원은 책임을 지지 않습니다.
• 사용자의 부주의로 비밀번호가 유출된 경우
• 사용자가 '상담삭제' 기능을 사용한 경우
• 천재지변등 기타 불가항력에 의한 경우
② 이용자의 상담요청에 대한 종합적이고 적절한 답변을 위하여 상담 의료인들은 상담 내용과 답변을 참고할 수 있습니다.
③ 서비스에서 진행된 상담의 내용은 특정 개인을 식별할 수 없는 형태로 다음과 같은 목적으로 사용할 수 있습니다.
• 학술활동
• 통계작성, 과학적 연구, 공익적 기록보존
• 인쇄물, CD-ROM 등의 저작활동
• FAQ, 추천 상담 등의 서비스 내용의 일부
④ 상담에 대한 답변 내용은 각 전문 의료인의 의학적 지식을 바탕으로 한 주관적인 답변으로 병원의 공식적인 의견이 될 수 없으며, 상담내용에 대하여 병원은 일체의 책임을 지지 않습니다.
⑤ 다음과 같은 상담신청의 경우에는 상담을 거절할 수 있습니다.
• 같은 내용의 상담을 반복하여 신청하는 경우
• 상식에 어긋나는 표현을 사용하여 상담을 신청하는 경우
• 진단명을 요구하는 상담을 신청하는 경우
• 치료비, 검사비, 의약품 가격 등에 대하여 상담을 신청하는 경우
• 상담 의료인에 대하여 폭언, 모욕의 행위를 하는 경우
14. 제 14조 (건강관련정보 제공 서비스)
• ① 병원에서 제공하는 건강관련정보는 개략적이며 일반적인 것으로서 특정인의 의견에 지나지 않으며 어떠한 경우에도 전문적인 의학적 진단, 진료, 치료를 대신할 수 없습니다.
• ② 병원은 건강관련정보제공서비스에서 언급된 어떠한 특정한 검사나 제품 또는 치료법을 보증하지 않습니다.
• ③ 병원은 제공하는 건강관련정보는 전적으로 이용자의 판단에 따라 이용되는 것으로서, 병원은 건강관련정보의 제공과 관련하여 어떠한 책임도 지지 않습니다.
15. 제 15조 (병원과 연결 사이트간의 관계)
• 병원은 연결 사이트가 독자적으로 제공하는 재화, 용역, 서비스에 의하여 이용자와 행하는 거래에 대해서 어떠한 보증 책임을 지지 않습니다.
제5장 병원 및 이용자의 의무
16. 제 16조 (병원의 의무)
• ① 병원은 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하는 데 최선을 다합니다.
• ② 병원은 이용자의 신용정보를 포함한 개인신상정보의 보안에 대하여 기술적 안전 조치를 강구하고 관리에 만전을 기함으로써 이용자의 정보보안에 최선을 다합니다.
• ③ 병원은 공정하고 건전한 운영과 지속적인 연구·개발을 통하여 양질의 서비스를 제공함으로써 고객만족을 극대화 하여 인터넷 비즈니스 발전에 기여하도록 합니다.
• ④ 병원은 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.
17. 제17조 (이용자의 주민등록번호 및 비밀번호에 대한 의무)
• ① 이용자는 병원 인터넷 진료를 이용하는 경우 주민등록번호(실명인증) 및 비밀번호를 사용해야 합니다.
• ② 주민등록번호(실명인증)와 비밀번호에 관한 모든 관리의 책임은 이용자에게 있습니다.
• ③ 이용자는 자신의 주민등록번호 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
• ④ 이용자의 주민등록번호 및 비밀번호의 관리의 부실로 인한 모든 책임은 이용자가 부담합니다.
• ⑤ 이용자는 주민등록번호 및 비밀번호를 도난당하거나 제3자에게 사용되고 있음을 인지한 경우에는 바로 병원에 통보하고 병원의 안내가 있는 경우에는 그에 따라야 합니다.
• ⑥ 이용자는 병원의 권고에 따라 6개월마다 비밀번호를 변경해야 하며, 비밀번호 변경 시 직전 비밀번호와 동일하게 설정할 수 없습니다.
• ⑦ 이용자는 제 10조 5항에 따른 비밀번호 정책을 준수하여야 합니다.
18. 제18조 (이용자의 의무)
• ① 이용자는 다음의 행위를 하여서는 안됩니다.
• 신청 또는 변경 시 허위내용의 등록
• 병원에 게시된 정보의 변경
• 병원이 정한 정보 이외의 정보(컴퓨터프로그램 등)의 송신 또는 게시
• 병원 기타 제3자의 저작권 등 지적재산권에 대한 침해
• 병원 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
• 외설 또는 폭력적인 메시지·화상·음성 기타 공서양속에 반하는 정보를 병원에 공개 또는 게시하는 행위
• 다른 이용자에 대한 건강진료 및 상담을 하거나 알선하는 행위
• 제3자의 진료행위를 선전하는 행위
• 상품을 판매하거나 판매를 알선하는 행위
• 기타 부적절하다고 판단하는 행위
② 전항 각호의 정보 또는 기타 병원이 사이트 운영상 부적절하다고 판단한 정보가 병원 홈페이지에 게시되거나 사이트와 링크된 곳에 게시된 경우, 병원은 이용자 또는 기타 정보의 게시를 행한 자의 승낙없이 병원 홈페이지에 게재된 당해 정보를 삭제하거나 링크를 단절할 수 있습니다. 단, 병원은 이러한 정보의 삭제·링크의 절단 등을 할 의무를 지지 않습니다.
제6장 기타
19. 제19조 (저작권의 귀속 및 이용제한)
• ① 병원은 작성한 저작물에 대한 저작권 기타 지적재산권은 병원에 귀속합니다.
• ② 이용자는 홈페이지를 이용함으로써 얻은 정보를 병원의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3 자에게 이용하게 하여서는 안 됩니다.
20. 제20조 (분쟁해결)
• ① 본 이용약관에 규정된 것을 제외하고 발생하는 서비스 이용에 관한 제반 문제에 관한 분쟁은 최대한 쌍방합의에 의해 해결하도록 합니다.
• ② 이용자가 홈페이지 이용과 관련하여 불만이 있거나 의견을 제시하고자 하는 경우에는 전자우편 혹은 홈페이지 내의 서비스 페이지로 홈페이지에 대한 불만사항 또는 의견을 제출 혹은 등록 하시면 됩니다.
• ③ 병원은 이용자로부터 제출되는 불만사항 및 의견이 정당하다고 판단하는 경우 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.
21. 제21조 (재판권 및 준거법)
• ① 병원과 이용자 간에 서비스 이용으로 발생한 분쟁에 관한 소송은 민사소송법상의 관할법원으로 합니다.
• ② 병원과 이용자 간에 제기된 전자거래 소송에는 한국법을 적용합니다.

 </textarea>
        

  
		 <div class="formacheck"> 
            <input type="checkbox" value="" id="agree11">
			<label>이용약관 동의<span>(필수)</span></label>
        </div>

  <br>
		<textarea class="form-control"  style="resize: none;" rows="8">개인정보처리방침

대덕병원에서 개인정보를 수집하고 이용하는 목적은 홈페이지 회원의 가입 및 관리를 위함입니다. 수집한 개인정보를 다음의 목적을 위해 활용합니다.
• ① 진료/건강검진 예약, 예약조회 및 검사/건진 결과조회, 웹문진, 처방받은 약 조회, 제증명, 의무기록사본 등 회원제 서비스 이용에 따른 본인 확인 절차에 사용
• ② 고지사항 전달 및 불만처리 등을 위한 의사소통 경로로 이용
• ③ 온라인 상담 답변 처리를 위한 자료
• ④ 진료의뢰 환자의 예약을 위한 자료
• ⑤ 대덕병원 모바일앱 서비스 제공을 위한 회원정보 연동
위 항의 원활한 업무처리를 위하여 개인정보 처리(취급) 업무(DM등)를 외부 전문업체에 위탁할 수 있으며 해당 내용은 홈페이지에 공개합니다.
대덕병원에서 수집하는 개인정보 항목은 다음과 같습니다.
[필수항목]
성명, 성별, 생년월일, 휴대전화, 아이디, 비밀번호, e-mail, 주소
개인정보의 보유 및 이용기간
개인정보는 대덕병원이 고객에게 서비스를 제공하는 기간에 한하여 보유 및 이용되며 회원 탈퇴시에는 즉시 파기합니다.
• ① 이용기간 : 회원 가입기간 (탈퇴 후 즉시 파기 / 1년 이상 미이용 시 개인정보 분리 보관)
• ② 진료서비스의 제공을 위하여 수집된 경우 : 의료법 기준에 준함
다만, 수집목적 또는 제공받은 목적이 달성된 경우에도 상법 등 법령의 규정에 의하여 보존할 필요성이 있는 경우에는 귀하의 개인정보를 보유할 수 있습니다.
 </textarea>
   
   
         <div class="formacheck">           
            <input type="checkbox" value="" id="agree21">
			<label>개인정보 수집 및 이용 동의<span>(필수)</span></label>
         </div>

    		<br>
    

		          		<div class="row col-12">
			          		<div class="col-6 text-center">
			          			<button type="button" onclick="location.href='<%=request.getContextPath()%>' "  id="modifyBtn" class="btn btn-block btn-secondary">취 소</button>
			          		</div>
		          		
			          		<div class="col-6 text-center">
			          			<button type="button"  onclick="form_Check();" class="btn btn-primary btn-block">확 인</button>
			          		</div>
		          			
		          	    </div>  	
		          

</form>



</div>

</div>
</div>

<script>
function form_Check(){

	if ($("#agree11").is(":checked") == false && $("#agree21").is(":checked") == false){
		alert('약관에 동의 후 회원가입 진행 가능합니다.');
		return;
    }else if($("#agree11").is(":checked") == false){
		alert('"이용약관" 동의 후 회원가입 진행 가능합니다.');
		return;
	}else if($("#agree21").is(":checked") == false){
		alert('"개인정보 수집 및 이용" 동의 후 회원가입 진행 가능합니다.');
		return;
	}else if ($("#agree11").is(":checked") == true && $("#agree21").is(":checked") == true){
		window.open("<%=request.getContextPath()%>/member/registForm.do", "_self");
	
	}
		
	}
	
	  



 </script>
    
<!-- jQuery -->
<script src="<%=request.getContextPath()%>/resources/bootstrap/plugins/jquery/jquery.min.js" ></script>
<!-- Bootstrap 4 -->
<script src="<%=request.getContextPath()%>/resources/bootstrap/plugins/bootstrap/js/bootstrap.bundle.min.js"></script>
<!-- AdminLTE App -->
<script src="<%=request.getContextPath()%>/resources/bootstrap/dist/js/adminlte.min.js"></script>

<script src="//t1.daumcdn.net/mapjsapi/bundle/postcode/prod/postcode.v2.js"></script>
</body>
</html>
